NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series1/EFR32FG12P/EFR32FG12P231F1024GM68.svd
        <register>
          <name>PRSSEL</name>
          <description>PRS Input Select Register</description>
          <addressOffset>0x050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0CCCF3CF</resetMask>
          <fields>
            <field>
              <name>PRSSTARTSEL</name>
              <description>PRS Start Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRSCH0</name>
                  <description>PRS Channel 0 selected as input</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH1</name>
                  <description>PRS Channel 1 selected as input</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH2</name>
                  <description>PRS Channel 2 selected as input</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH3</name>
                  <description>PRS Channel 3 selected as input</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH4</name>
                  <description>PRS Channel 4 selected as input</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH5</name>
                  <description>PRS Channel 5 selected as input</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH6</name>
                  <description>PRS Channel 6 selected as input</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH7</name>
                  <description>PRS Channel 7 selected as input</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH8</name>
                  <description>PRS Channel 8 selected as input</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH9</name>
                  <description>PRS Channel 9 selected as input</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH10</name>
                  <description>PRS Channel 10 selected as input</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH11</name>
                  <description>PRS Channel 11 selected as input</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRSSTOPSEL</name>
              <description>PRS Stop Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRSCH0</name>
                  <description>PRS Channel 0 selected as input</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH1</name>
                  <description>PRS Channel 1 selected as input</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH2</name>
                  <description>PRS Channel 2 selected as input</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH3</name>
                  <description>PRS Channel 3 selected as input</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH4</name>
                  <description>PRS Channel 4 selected as input</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH5</name>
                  <description>PRS Channel 5 selected as input</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH6</name>
                  <description>PRS Channel 6 selected as input</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH7</name>
                  <description>PRS Channel 7 selected as input</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH8</name>
                  <description>PRS Channel 8 selected as input</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH9</name>
                  <description>PRS Channel 9 selected as input</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH10</name>
                  <description>PRS Channel 10 selected as input</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH11</name>
                  <description>PRS Channel 11 selected as input</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRSCLEARSEL</name>
              <description>PRS Clear Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRSCH0</name>
                  <description>PRS Channel 0 selected as input</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH1</name>
                  <description>PRS Channel 1 selected as input</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH2</name>
                  <description>PRS Channel 2 selected as input</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH3</name>
                  <description>PRS Channel 3 selected as input</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH4</name>
                  <description>PRS Channel 4 selected as input</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH5</name>
                  <description>PRS Channel 5 selected as input</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH6</name>
                  <description>PRS Channel 6 selected as input</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH7</name>
                  <description>PRS Channel 7 selected as input</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH8</name>
                  <description>PRS Channel 8 selected as input</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH9</name>
                  <description>PRS Channel 9 selected as input</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH10</name>
                  <description>PRS Channel 10 selected as input</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH11</name>
                  <description>PRS Channel 11 selected as input</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRSSTARTMODE</name>
              <description>PRS Start Mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>PRS cannot start the LETIMER</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Rising edge of selected PRS input can start the LETIMER</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Falling edge of selected PRS input can start the LETIMER</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both the rising or falling edge of the selected PRS input can start the LETIMER</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRSSTOPMODE</name>
              <description>PRS Stop Mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>PRS cannot stop the LETIMER</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Rising edge of selected PRS input can stop the LETIMER</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Falling edge of selected PRS input can stop the LETIMER</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both the rising or falling edge of the selected PRS input can stop the LETIMER</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRSCLEARMODE</name>
              <description>PRS Clear Mode</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>PRS cannot clear the LETIMER</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Rising edge of selected PRS input can clear the LETIMER</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Falling edge of selected PRS input can clear the LETIMER</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both the rising or falling edge of the selected PRS input can clear the LETIMER</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
