NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series1/EFR32FG12P/EFR32FG12P231F1024GM68.svd
        <register>
          <name>ST24_TCONFA</name>
          <description>State Transition Configuration a</description>
          <addressOffset>0x1C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007DFFF</resetMask>
          <fields>
            <field>
              <name>COMP</name>
              <description>Sensor Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK</name>
              <description>Sensor Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEXTSTATE</name>
              <description>Next State Index</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHAIN</name>
              <description>Enable State Descriptor Chaining</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETIF</name>
              <description>Set Interrupt Flag Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSACT</name>
              <description>Configure Transition Action</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              </field>
          </fields>
        </register>
        <register>
          <name>ST24_TCONFB</name>
          <description>State Transition Configuration B</description>
          <addressOffset>0x1C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00079FFF</resetMask>
          <fields>
            <field>
              <name>COMP</name>
              <description>Sensor Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK</name>
              <description>Sensor Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEXTSTATE</name>
              <description>Next State Index</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETIF</name>
              <description>Set Interrupt Flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSACT</name>
              <description>Configure Transition Action</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              </field>
          </fields>
        </register>
        <register>
          <name>ST25_TCONFA</name>
          <description>State Transition Configuration a</description>
          <addressOffset>0x1C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007DFFF</resetMask>
          <fields>
            <field>
              <name>COMP</name>
              <description>Sensor Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK</name>
              <description>Sensor Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEXTSTATE</name>
              <description>Next State Index</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHAIN</name>
              <description>Enable State Descriptor Chaining</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETIF</name>
              <description>Set Interrupt Flag Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSACT</name>
              <description>Configure Transition Action</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              </field>
          </fields>
        </register>
        <register>
          <name>ST25_TCONFB</name>
          <description>State Transition Configuration B</description>
          <addressOffset>0x1CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00079FFF</resetMask>
          <fields>
            <field>
              <name>COMP</name>
              <description>Sensor Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK</name>
              <description>Sensor Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEXTSTATE</name>
              <description>Next State Index</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETIF</name>
              <description>Set Interrupt Flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSACT</name>
              <description>Configure Transition Action</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              </field>
          </fields>
        </register>
        <register>
          <name>ST26_TCONFA</name>
          <description>State Transition Configuration a</description>
          <addressOffset>0x1D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007DFFF</resetMask>
          <fields>
            <field>
              <name>COMP</name>
              <description>Sensor Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK</name>
              <description>Sensor Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEXTSTATE</name>
              <description>Next State Index</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHAIN</name>
              <description>Enable State Descriptor Chaining</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETIF</name>
              <description>Set Interrupt Flag Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSACT</name>
              <description>Configure Transition Action</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              </field>
          </fields>
        </register>
        <register>
          <name>ST26_TCONFB</name>
          <description>State Transition Configuration B</description>
          <addressOffset>0x1D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00079FFF</resetMask>
          <fields>
            <field>
              <name>COMP</name>
              <description>Sensor Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK</name>
              <description>Sensor Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEXTSTATE</name>
              <description>Next State Index</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETIF</name>
              <description>Set Interrupt Flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSACT</name>
              <description>Configure Transition Action</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              </field>
          </fields>
        </register>
        <register>
          <name>ST27_TCONFA</name>
          <description>State Transition Configuration a</description>
          <addressOffset>0x1D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007DFFF</resetMask>
          <fields>
            <field>
              <name>COMP</name>
              <description>Sensor Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK</name>
              <description>Sensor Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEXTSTATE</name>
              <description>Next State Index</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHAIN</name>
              <description>Enable State Descriptor Chaining</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETIF</name>
              <description>Set Interrupt Flag Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSACT</name>
              <description>Configure Transition Action</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              </field>
          </fields>
        </register>
        <register>
          <name>ST27_TCONFB</name>
          <description>State Transition Configuration B</description>
          <addressOffset>0x1DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00079FFF</resetMask>
          <fields>
            <field>
              <name>COMP</name>
              <description>Sensor Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK</name>
              <description>Sensor Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEXTSTATE</name>
              <description>Next State Index</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETIF</name>
              <description>Set Interrupt Flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSACT</name>
              <description>Configure Transition Action</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              </field>
          </fields>
        </register>
        <register>
          <name>ST28_TCONFA</name>
          <description>State Transition Configuration a</description>
          <addressOffset>0x1E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007DFFF</resetMask>
          <fields>
            <field>
              <name>COMP</name>
              <description>Sensor Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK</name>
              <description>Sensor Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEXTSTATE</name>
              <description>Next State Index</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHAIN</name>
              <description>Enable State Descriptor Chaining</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETIF</name>
              <description>Set Interrupt Flag Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSACT</name>
              <description>Configure Transition Action</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              </field>
          </fields>
        </register>
        <register>
          <name>ST28_TCONFB</name>
          <description>State Transition Configuration B</description>
          <addressOffset>0x1E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00079FFF</resetMask>
          <fields>
            <field>
              <name>COMP</name>
              <description>Sensor Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK</name>
              <description>Sensor Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEXTSTATE</name>
              <description>Next State Index</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETIF</name>
              <description>Set Interrupt Flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSACT</name>
              <description>Configure Transition Action</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              </field>
          </fields>
        </register>
        <register>
          <name>ST29_TCONFA</name>
          <description>State Transition Configuration a</description>
          <addressOffset>0x1E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007DFFF</resetMask>
          <fields>
            <field>
              <name>COMP</name>
              <description>Sensor Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK</name>
              <description>Sensor Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEXTSTATE</name>
              <description>Next State Index</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHAIN</name>
              <description>Enable State Descriptor Chaining</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETIF</name>
              <description>Set Interrupt Flag Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSACT</name>
              <description>Configure Transition Action</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              </field>
          </fields>
        </register>
        <register>
          <name>ST29_TCONFB</name>
          <description>State Transition Configuration B</description>
          <addressOffset>0x1EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00079FFF</resetMask>
          <fields>
            <field>
              <name>COMP</name>
              <description>Sensor Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK</name>
              <description>Sensor Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEXTSTATE</name>
              <description>Next State Index</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETIF</name>
              <description>Set Interrupt Flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSACT</name>
              <description>Configure Transition Action</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              </field>
          </fields>
        </register>
        <register>
          <name>ST30_TCONFA</name>
          <description>State Transition Configuration a</description>
          <addressOffset>0x1F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007DFFF</resetMask>
          <fields>
            <field>
              <name>COMP</name>
              <description>Sensor Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK</name>
              <description>Sensor Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEXTSTATE</name>
              <description>Next State Index</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHAIN</name>
              <description>Enable State Descriptor Chaining</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETIF</name>
              <description>Set Interrupt Flag Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSACT</name>
              <description>Configure Transition Action</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              </field>
          </fields>
        </register>
